app/views/orders/index.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 298486374]]
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 298486374]]
---
        <td>
          count: <%= order.line_items.count %>