app/views/carts/_cart.html.erb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 980190962]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 980190962]]
---
<%= hide_div_if cart.line_items.empty? do %>