app/controllers/line_items_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-03-05 03:37:50.029715"], ["updated_at", "2015-03-05 03:37:50.029715"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 387902468], ["cart_id", 980190963], ["created_at", "2015-03-05 03:40:45.958638"], ["updated_at", "2015-03-05 03:40:45.958638"]]
---
  def create
    @cart = current_cart
    product = Product.find params[:product_id]
    @line_item = @cart.add_product product

    respond_to do |format|
      if @line_item.save