app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate(:page => params[:page], :per_page => 10).order("created_at DESC")
---
SELECT  "orders".* FROM "orders"  ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def new
    if current_cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 980190963]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart current_cart

    respond_to do |format|
      if @order.save
        current_cart.destroy
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver_later
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-03-14 12:51:22.366461"], ["updated_at", "2015-03-14 12:51:22.366461"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "MyString"], ["address", "MyString"], ["email", "MyString"], ["pay_type", "MyString"], ["created_at", "2015-03-14 11:47:04.672458"], ["updated_at", "2015-03-14 11:47:04.672458"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = ?  [["order_id", 980190963]]