app/controllers/products_controller.rb

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "    <h2>岂止于大！！</h2>\r\n    <p>iPhone 6 Plus 你值得拥有。</p>\r\n  "], ["image_url", "/images/ruby.gif"], ["updated_at", "2015-03-02 06:41:24.037974"], ["id", 4]]